#!/usr/bin/env ruby

FLIPPED_LETTERS = {
	" " => " ",
	"a" => "ɐ",
	"b" => "q",
	"c" => "ɔ",
	"d" => "p",
	"e" => "ǝ",
	"f" => "ɟ",
	"g" => "ƃ",
	"h" => "ɥ",
	"i" => "ı",
	"j" => "ɾ",
	"k" => "ʞ",
	"l" => "l",
	"m" => "ɯ",
	"n" => "u",
	"o" => "o",
	"p" => "d",
	"q" => "b",
	"r" => "ɹ",
	"s" => "s",
	"t" => "ʇ",
	"u" => "n",
	"v" => "ʌ",
	"w" => "ʍ",
	"x" => "x",
	"y" => "ʎ",
	"z" => "z",
	"A" => "∀",
	"B" => "q",
	"C" => "Ɔ",
	"D" => "p",
	"E" => "Ǝ",
	"F" => "Ⅎ",
	"G" => "פ",
	"H" => "H",
	"I" => "I",
	"J" => "ſ",
	"K" => "ʞ",
	"L" => "˥",
	"M" => "W",
	"N" => "N",
	"O" => "O",
	"P" => "Ԁ",
	"Q" => "Q",
	"R" => "ɹ",
	"S" => "S",
	"T" => "┴",
	"U" => "∩",
	"V" => "Λ",
	"W" => "M",
	"X" => "X",
	"Y" => "⅄",
	"Z" => "Z",
	"," => "'",
	"!" => "¡",
	"?" => "¿",
	"(" => ")",
	")" => "(",
	"[" => "]",
	"]" => "[",
	"." => "˙",
	'"' => ",,",
	"'" => ","
}

FLIP = {
	flipping:   "(╯°□°)╯︵ ┻━┻",
	patience:   "┬─┬ ノ( ゜-゜ノ)",
	pudgy:	    "(ノ ゜Д゜)ノ ︵ ┻━┻",
	battle:     "(╯°□°)╯︵ ┻━┻ ︵ ╯(°□° ╯)",
	me:         "┬─┬ ︵ /(.□. \)",
	aggravated: "(ﾉಥ益ಥ）ﾉ ┻━┻",
	putback:    "(ノ^_^)ノ┻━┻ ┬─┬ ノ( ^_^ノ)",
	dude:       "(╯°Д°）╯︵ /(.□ . \)",
	emotional:  "(╯'□')╯︵ ┻━┻",
	freakout:   "(ﾉಥДಥ)ﾉ︵┻━┻･/",
	hercules:   "(/ .□.)\ ︵╰(゜Д゜)╯︵ /(.□. \)",
	jedi:       "(._.) ~ ︵ ┻━┻",
	bear:       "ʕノ•ᴥ•ʔノ ︵ ┻━┻",
	magical:    "(/¯◡ ‿ ◡)/¯ ~ ┻━┻",
	robot:      "┗[© ♒ ©]┛ ︵ ┻━┻",
	russia:     "ノ┬─┬ノ ︵ ( \o°o)\ ",
	happy:      "┻━┻ ︵ ლ(⌒-⌒ლ)"
}

def flip_word(word)
   word.split(//).reverse.map do |l|
    FLIPPED_LETTERS[l].nil? ? l : FLIPPED_LETTERS[l]
  end.join("")
end

if ARGV.size > 0
  flipped_word = flip_word(ARGV.join(' '))
  print "(╯°□°)╯︵ #{flipped_word}"
end
