tap "homebrew/bundle"
brew "mas"
brew "asdf"
brew "difftastic"
brew "fzf"
brew "macvim"
brew "ripgrep"
brew "speedtest-cli"
brew "stow"
brew "thefuck"
brew "yq"
brew "jq"
brew "gh"
brew "git-delete-merged-branches"

# k8s stuff
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kind"
brew "kube-ps1"


cask "1password-cli"
cask "google-cloud-sdk"

tap "zackelia/formulae"
brew "bclm"

mas "Amphetamine", id: 937984704
