tap "caarlos0/tap"
tap "conikeec/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "localstack/tap"
tap "teamookla/speedtest"
tap "zackelia/formulae"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Diff that understands syntax
brew "difftastic"
# Program that can automate interactive applications
brew "expect"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Automatic git commit --fixup
brew "git-absorb"
# Command-line tool to delete merged Git branches
brew "git-delete-merged-branches"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm", link: false
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# JSON diff and patch
brew "jd"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Heavily optimized DEFLATE/zlib/gzip compression and decompression
brew "libdeflate"
# Next-gen compiler infrastructure
brew "llvm"
# LLVM Project Linker
brew "lld"
# Package manager for the Lua programming language
brew "luarocks"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Parallel gzip
brew "pigz"
# Object-relational database system
brew "postgresql@14"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Simple keystroke visualizer
brew "showkey"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Semantic Version Utility
brew "caarlos0/tap/svu"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Command-line interface for 1Password
cask "1password-cli"
# Column-oriented database management system
cask "clickhouse"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# 2D game framework for Lua
cask "love"
# Development environment
cask "vagrant"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
