tap "homebrew/bundle"
tap "zackelia/formulae"

# work specific
#brew "awscli"
#brew "helm"
#brew "kind"
#brew "krew"
#brew "kube-ps1"
#brew "kubectx"
#brew "kubernetes-cli"
#brew "protobuf"
#brew "shellcheck"
#brew "speedtest-cli"
#brew "terraform"
#cask "google-cloud-sdk"
#cask "ibm-cloud-cli"
#cask "vagrant"

brew "asdf"
brew "bat"
brew "difftastic"
brew "fzf"
brew "gh"
brew "git-delete-merged-branches"
brew "httpie"
brew "jq"
brew "macvim"
brew "mas"
brew "ripgrep"
brew "stow"
brew "thefuck"
brew "watch"
brew "yq"
brew "zackelia/formulae/bclm"
cask "1password-cli"
mas "Amphetamine", id: 937984704
